[{"desc": "Thriller. Gary Oldman stars as a British Secret Service agent brought out of retirement to track down a defector at the head of Ml6. Violent scenes/strong language/sexual scenes.", "time": "Sun 08 Sep 21:00", "subtitle": null, "title": "Tinker Tailor Soldier Spy"}, {"desc": "Animated deep sea adventures with Captain Barnacles and his explorers. Tweak and her crewmates must convert the Gup-F into an artificial reef.", "time": "Mon 09 Sep 16:45", "subtitle": "Artificial Reef", "title": "New: Octonauts"}, {"desc": "Liam experiences the symptoms of post-traumatic stress disorder. Annie is angry with Naomi when she tracks down their half-brother Mark.", "time": "Mon 09 Sep 21:00", "subtitle": "Brother from Another Mother", "title": "90210"}, {"desc": "Animated deep sea adventures with Captain Barnacles and his explorers. When a sardine swallows an important key, a humpback whale helps Kwazii track it down.", "time": "Tue 10 Sep 16:45", "subtitle": "Humpback Whales", "title": "New: Octonauts"}, {"desc": "Animated deep sea adventures with Captain Barnacles and his explorers. A floating garbage patch endangers a flock of pelicans and other sea creatures.", "time": "Wed 11 Sep 16:45", "subtitle": "Pelicans", "title": "New: Octonauts"}, {"desc": "Animated deep sea adventures with Captain Barnacles and his explorers. The Octonauts must stop a huge herd of sea pigs before they march blindly into the Mariana Trench.", "time": "Thu 12 Sep 16:45", "subtitle": "Sea Pigs", "title": "New: Octonauts"}, {"desc": "Spencer is still reeling from rejection by Caggie when he sees her on a date with Thomas. Ollie is forging ahead with his book and decides to do a chapter on virginity.", "time": "Thu 12 Sep 21:00", "subtitle": null, "title": "Made In Chelsea"}, {"desc": "Animated deep sea adventures with Captain Barnacles and his explorers. A yeti crab damages the ship, endangering itself and the Octonauts.", "time": "Fri 13 Sep 16:45", "subtitle": "Yeti Crab", "title": "New: Octonauts"}, {"desc": "Highlights including Manchester United v Crystal Palace and Aston Villa v Newcastle. Also in HD.  Followed by National Lottery Update.", "time": "Sat 14 Sep 22:30", "subtitle": null, "title": "Match of the Day"}]